In [101]:
import pandas as pd
import numpy as np

In [102]:
prelim_data = pd.read_csv(r'C:\Users\akhip\OneDrive\Desktop\HouseDataProj\realtor-data.csv')
prelim_data.head()

,status,price,bed,bath,acre_lot,full_address,street,city,state,zip_code,house_size,sold_date
0,for_sale,105000.0,3.0,2.0,0.12,"Sector Yahuecas Titulo # V84, Adjuntas, PR, 00601",Sector Yahuecas Titulo # V84,Adjuntas,Puerto Rico,601.0,920.0,NaN
1,for_sale,80000.0,4.0,2.0,0.08,"Km 78 9 Carr # 135, Adjuntas, PR, 00601",Km 78 9 Carr # 135,Adjuntas,Puerto Rico,601.0,1527.0,NaN
2,for_sale,67000.0,2.0,1.0,0.15,"556G 556-G 16 St, Juana Diaz, PR, 00795",556G 556-G 16 St,Juana Diaz,Puerto Rico,795.0,748.0,NaN
3,for_sale,145000.0,4.0,2.0,0.10,"R5 Comunidad El Paraso Calle De Oro R-5 Ponce,...",R5 Comunidad El Paraso Calle De Oro R-5 Ponce,Ponce,Puerto Rico,731.0,1800.0,NaN
4,for_sale,65000.0,6.0,2.0,0.05,"14 Navarro, Mayaguez, PR, 00680",14 Navarro,Mayaguez,Puerto Rico,680.0,NaN,NaN

In [103]:
prelim_data['state'].fillna(method='ffill', inplace = True)
prelim_data.head()

,status,price,bed,bath,acre_lot,full_address,street,city,state,zip_code,house_size,sold_date
0,for_sale,105000.0,3.0,2.0,0.12,"Sector Yahuecas Titulo # V84, Adjuntas, PR, 00601",Sector Yahuecas Titulo # V84,Adjuntas,Puerto Rico,601.0,920.0,NaN
1,for_sale,80000.0,4.0,2.0,0.08,"Km 78 9 Carr # 135, Adjuntas, PR, 00601",Km 78 9 Carr # 135,Adjuntas,Puerto Rico,601.0,1527.0,NaN
2,for_sale,67000.0,2.0,1.0,0.15,"556G 556-G 16 St, Juana Diaz, PR, 00795",556G 556-G 16 St,Juana Diaz,Puerto Rico,795.0,748.0,NaN
3,for_sale,145000.0,4.0,2.0,0.10,"R5 Comunidad El Paraso Calle De Oro R-5 Ponce,...",R5 Comunidad El Paraso Calle De Oro R-5 Ponce,Ponce,Puerto Rico,731.0,1800.0,NaN
4,for_sale,65000.0,6.0,2.0,0.05,"14 Navarro, Mayaguez, PR, 00680",14 Navarro,Mayaguez,Puerto Rico,680.0,NaN,NaN

In [104]:
NJ_df = prelim_data[prelim_data['state'] == 'New Jersey']
NJ_df.head()

,status,price,bed,bath,acre_lot,full_address,street,city,state,zip_code,house_size,sold_date
30126,for_sale,333490.0,3.0,3.0,0.07,"Katherine, Burlington, NJ, 08016",Katherine,Burlington,New Jersey,8016.0,1500.0,NaN
45320,for_sale,333490.0,3.0,3.0,0.07,"Katherine, Burlington, NJ, 08016",Katherine,Burlington,New Jersey,8016.0,1500.0,NaN
385082,for_sale,333490.0,3.0,3.0,0.07,"Katherine, Burlington, NJ, 08016",Katherine,Burlington,New Jersey,8016.0,1500.0,NaN
388797,for_sale,333490.0,3.0,3.0,0.07,"Katherine, Burlington, NJ, 08016",Katherine,Burlington,New Jersey,8016.0,1500.0,NaN
389915,for_sale,333490.0,3.0,3.0,0.07,"Katherine, Burlington, NJ, 08016",Katherine,Burlington,New Jersey,8016.0,1500.0,NaN

In [105]:
columns_to_drop = ['status', 'full_address', 'street', 'sold_date', 'city']  # List of column names to drop
NJ_drop = NJ_df.drop(columns=columns_to_drop)

In [106]:
NJ_drop.head()
NJ_drop.shape

(191280, 7)

In [107]:
deduplicated_df = NJ_drop.drop_duplicates()
deduplicated_df.shape

(31668, 7)

In [109]:
NJ_index = deduplicated_df.reset_index(drop=True)
NJ_index = NJ_index.rename_axis("idx", axis=1)
NJ_index.head()

idx     price  bed  bath  acre_lot       state  zip_code  house_size
0    333490.0  3.0   3.0      0.07  New Jersey    8016.0      1500.0
1    339900.0  2.0   2.0      0.11  New Jersey    7001.0      1456.0
2    305100.0  3.0   2.0      0.14  New Jersey    7001.0      1542.0
3    205000.0  3.0   1.0      0.11  New Jersey    7001.0       925.0
4    479000.0  NaN   NaN      0.11  New Jersey    7001.0         NaN

In [110]:
NJ_index['zip_code'].isnull().values.any()

False

In [111]:
def calculate_mean(column):
    mean = NJ_index[column].mean()
    return mean

NJ_index['price'].fillna(value=calculate_mean('price'), inplace=True)
NJ_index['bed'].fillna(value=round(calculate_mean('bed')), inplace=True)
NJ_index['bath'].fillna(value=round(calculate_mean('bath')), inplace=True)
NJ_index['acre_lot'].fillna(value=calculate_mean('acre_lot'), inplace=True)
NJ_index['house_size'].fillna(value=round(calculate_mean('house_size')), inplace=True)
NJ_index.head()

idx     price  bed  bath  acre_lot       state  zip_code  house_size
0    333490.0  3.0   3.0      0.07  New Jersey    8016.0      1500.0
1    339900.0  2.0   2.0      0.11  New Jersey    7001.0      1456.0
2    305100.0  3.0   2.0      0.14  New Jersey    7001.0      1542.0
3    205000.0  3.0   1.0      0.11  New Jersey    7001.0       925.0
4    479000.0  3.0   3.0      0.11  New Jersey    7001.0      2330.0

In [138]:
NJ_index_copy = NJ_index
NJ_index.shape

(31668, 7)

In [146]:
def remove_outliers(df,columns,n_std):
    for col in columns:
        print('Working on column: {}'.format(col))
        
        mean = df[col].mean()
        sd = df[col].std()
        
        df = df[(df[col] <= mean+(n_std*sd))]
        
    return df

removed_outliers_df = remove_outliers(NJ_index_copy, ['bed', 'bath', 'acre_lot', 'price', 'house_size'], 3)

Working on column: bed
Working on column: bath
Working on column: acre_lot
Working on column: price
Working on column: house_size

In [147]:
removed_outliers_df.shape

(30050, 7)

In [151]:
removed_outliers_df['zip_code'] = removed_outliers_df['zip_code'].astype(str)
removed_outliers_df['zip_code'] = removed_outliers_df['zip_code'].str.replace('.', '')
removed_outliers_df.head()

idx     price  bed  bath  acre_lot       state zip_code  house_size
0    333490.0  3.0   3.0      0.07  New Jersey    80160      1500.0
1    339900.0  2.0   2.0      0.11  New Jersey    70010      1456.0
2    305100.0  3.0   2.0      0.14  New Jersey    70010      1542.0
3    205000.0  3.0   1.0      0.11  New Jersey    70010       925.0
4    479000.0  3.0   3.0      0.11  New Jersey    70010      2330.0

In [153]:
removed_outliers_df.dtypes

idx
price         float64
bed           float64
bath          float64
acre_lot      float64
state          object
zip_code       object
house_size    float64
dtype: object

In [162]:
data = removed_outliers_df

In [163]:
data.to_csv('Pre_processed.csv')

In [158]:
data.head()

idx     price  bed  bath  acre_lot       state zip_code  house_size
0    333490.0  3.0   3.0      0.07  New Jersey    80160      1500.0
1    339900.0  2.0   2.0      0.11  New Jersey    70010      1456.0
2    305100.0  3.0   2.0      0.14  New Jersey    70010      1542.0
3    205000.0  3.0   1.0      0.11  New Jersey    70010       925.0
4    479000.0  3.0   3.0      0.11  New Jersey    70010      2330.0

In [161]:
balls = pd.read_csv('Pre_processed.csv')
balls.head()

   Unnamed: 0     price  bed  bath  acre_lot       state  zip_code  house_size
0           0  333490.0  3.0   3.0      0.07  New Jersey     80160      1500.0
1           1  339900.0  2.0   2.0      0.11  New Jersey     70010      1456.0
2           2  305100.0  3.0   2.0      0.14  New Jersey     70010      1542.0
3           3  205000.0  3.0   1.0      0.11  New Jersey     70010       925.0
4           4  479000.0  3.0   3.0      0.11  New Jersey     70010      2330.0